"""Типы аккаунтов и важные файлы"""

# cat /etc/passwd ---> посмотреть все аккаунты.
# sudo vat /etc/shadow ---> посмотреть пароли.
# cat /etc/group ---> посмотреть группы.
# su (name user) ---> смена юзера.
# id ---> показывает все id
# id (name user) ---> можно посмотреть все данные id другово юзера.
# last ---> показывает последнии логины.
# who ---> показывает кто сейчас находится в системе.
# w ---> тоже самое что и who но больше информации показывает.
# sudo ---> Запустить команду на правах Super User.
