# Поменять язык ---> Super + Space (Windows + Space)

"""Команлды Linux"""

# uptime ---> показывает сколько времени включён компьютер.
# uname ---> показыввет какой линукс.
# uname -a ---> показвываюет всю инфу о линуксе.
# lscpu ---> показывает какой процессор.
# clear ---> очистка терминала.
# ls ---> показывает какие данные есть в данной дериктории в которой мы находимся.
# ls -l ---> показывает какие данные есть в данной дериктории в которой мы находимся  в длинном формате.
# echo $PATH ---> показывает директории в которых будет искать Линукс,наши команды которые мы запускаем в терминале.
#  echo ---> команда которая выводит текст в терминале.
# (левая)Ctrl + Alt + F3 ---> переключения с графического интерфейса в полностью текстовый.
# (левая)Ctrl + Alt + F7 ---> вернуться в графический интерфейс.
# man -k (пример: time)---> если не знаете команду но знаете с чем вам надо работать пишите и он показывает все команды.
# man (команда) ---> вывод полной информации о команде.
# info (команда) ---> ещё один вариант вывод информации о команде.
# whatis (команда) ---> коротко о команде.
# whereis (команда) ---> показывает путь к файлу.
# locate (команда) ---> найти названия файла
# ps ---> посмотреть какие процессы идут на моём пользователе.
# ping (сайт) ---> чтоб остановить Ctrl + C, а если нажмём Ctrl + Z то тогда заснёт но пинг продолжнь бежать
# fg ---> это команда вернет наш ping на лицевую сторону и сможем его увидеть.
# ls -la -R / ---> показывает все файлы данные на компе.

"""Навигация по системе"""

# ls -la ---> показывает какие данные есть в данной дериктории в которой мы находимся в том числе и скрытые данные.
# pwd ---> вывести путь где мы сейчас находимся.
# cd .. ---> возвращает на одну дерикторию выше.
# cd ../.. ---> возвращает на две дериктории выше.
# cd или cd ~ ---> возвращает в домашнию дерикторию не важно где вы находитесь.
# / ---> коренная директория Linux.
# ~ ---> сокращение нашей Home директории.

"""Работа с файлами"""

# cat (названия файла) ---> прочитает файл и выведит на экран.
# more (названия файла) ---> прочитает файл и выведит на экран.
# less (названия файла) ---> прочитает файл и выведит на экран.
# touch (названия файла) ---> создаёт файл.Если файл уже есть просто изменит дату и время в данный момент.
# cp (названия файла) (куда копировать,путь) ---> копирует файл.
# rm ---> удаляет файл.
# mv ---> перенести или переименовать файл.